#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fastly_service_vcl.service will be created
  + resource "fastly_service_vcl" "service" {
      + activate           = true
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_destroy      = true
      + force_refresh      = (known after apply)
      + http3              = false
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "stage"
      + stale_if_error     = false
      + stale_if_error_ttl = 43200

      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + domain {
          + name = "stage.hkakehas.tokyo"
        }

      + vcl {
          + content = <<-EOT
                sub vcl_recv {
                #FASTLY recv
                
                  # Normally, you should consider requests other than GET and HEAD to be uncacheable
                  # (to this we add the special FASTLYPURGE method)
                  if (req.method != "HEAD" && req.method != "GET" && req.method != "FASTLYPURGE") {
                    return(pass);
                  }
                
                  # If you are using image optimization, insert the code to enable it here
                  # See https://www.fastly.com/documentation/reference/io/ for more information.
                
                  return(lookup);
                }
                
                sub vcl_hash {
                  set req.hash += req.url;
                  set req.hash += req.http.host;
                #FASTLY hash
                  return(hash);
                }
                
                sub vcl_hit {
                #FASTLY hit
                  return(deliver);
                }
                
                sub vcl_miss {
                #FASTLY miss
                  return(fetch);
                }
                
                sub vcl_pass {
                #FASTLY pass
                  return(pass);
                }
                
                sub vcl_fetch {
                #FASTLY fetch
                
                  # Unset headers that reduce cacheability for images processed using the Fastly image optimizer
                  if (req.http.X-Fastly-Imageopto-Api) {
                    unset beresp.http.Set-Cookie;
                    unset beresp.http.Vary;
                  }
                
                  # Log the number of restarts for debugging purposes
                  if (req.restarts > 0) {
                    set beresp.http.Fastly-Restarts = req.restarts;
                  }
                
                  # If the response is setting a cookie, make sure it is not cached
                  if (beresp.http.Set-Cookie) {
                    return(pass);
                  }
                
                  # By default we set a TTL based on the `Cache-Control` header but we don't parse additional directives
                  # like `private` and `no-store`. Private in particular should be respected at the edge:
                  if (beresp.http.Cache-Control ~ "(?:private|no-store)") {
                    return(pass);
                  }
                
                  # If no TTL has been provided in the response headers, set a default
                  if (!beresp.http.Expires && !beresp.http.Surrogate-Control ~ "max-age" && !beresp.http.Cache-Control ~ "(?:s-maxage|max-age)") {
                    set beresp.ttl = 3600s;
                
                    # Apply a longer default TTL for images processed using Image Optimizer
                    if (req.http.X-Fastly-Imageopto-Api) {
                      set beresp.ttl = 2592000s; # 30 days
                      set beresp.http.Cache-Control = "max-age=2592000, public";
                    }
                  }
                
                  return(deliver);
                }
                
                sub vcl_error {
                #FASTLY error
                  return(deliver);
                }
                
                sub vcl_deliver {
                #FASTLY deliver
                  return(deliver);
                }
                
                sub vcl_log {
                #FASTLY log
                }
            EOT
          + main    = true
          + name    = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @hrmsk66, Action: `pull_request`, Working Directory: `stage/`, Workflow: `Deploy stage`*